cask_args appdir: '/Applications'

brew 'git'

tap 'homebrew/services'
tap 'homebrew/bundle'

brew 'jq'
brew 'postgresql'
brew 'phantomjs'
brew 'gist'
brew 'openssh'
brew 'qt@5.5'
brew 'python'
brew 'wget'
brew 'openssl'
brew 'jq'
brew 'pkg-config'
brew 'node'
brew 'librsvg'
brew 'imagemagick', args: ['with-librsvg']
brew 'apm-bash-completion'
brew 'zsh'
brew 'zsh-completions'

cask 'java'
cask 'alfred'
cask 'adobe-creative-cloud'		
cask 'android-platform-tools'		
cask 'android-sdk'		
cask 'android-studio'
cask 'atom'
cask 'citrix-receiver'		
cask 'firefox'		
cask 'flowdock' 
cask 'google-chrome'		
cask 'sizeup'		
cask 'sourcetree'		
