cask_args appdir: '/Applications'

brew 'git'

tap 'homebrew/services'
tap 'homebrew/bundle'

brew 'argon/mas/mas'
brew 'postgresql'
brew 'phantomjs'
brew 'gist'
brew 'openssh'
brew 'qt@5.5'
brew 'python'
brew 'wget'
brew 'openssl'
brew 'pkg-config'
brew 'node'
brew 'librsvg'
brew 'imagemagick', args: ['with-librsvg']
brew 'apm-bash-completion'
brew 'zsh'
brew 'zsh-completions'

cask install 'java'
cask install 'alfred'
cask install 'atom'
cask install 'flowdock' 
cask install 'firefox'		
cask install 'google-chrome'		
cask install 'sourcetree'		
cask install 'citrix-receiver'		
cask install 'adobe-creative-cloud'		
cask install 'android-platform-tools'		
cask install 'android-sdk'		
cask install 'android-studio'
